Статистика работы механизмов/Конфигурация/DataProcessors/_КонтрольВыпискиИОтчетовБрокераВСЭДИнфинитум.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_КонтрольВыпискиИОтчетовБрокераВСЭДИнфинитум</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_КонтрольВыпискиИОтчетовБрокераВСЭДИнфинитум/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка, "Контроль выписки и отчетов брокера в СЭД Инфинитум", "0.2", , Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "КонтрольВыпискиВСЭДИнфинитумМДТраст", 		"Контроль выписки в СЭД Инфинитум (МД Траст)"			,,	Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "КонтрольОтчетовБрокераВСЭДИнфинитумМДТраст",	"Контроль отчетов брокера в СЭД Инфинитум (МД Траст)"	,,	Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции 

Процедура ОтправитьУведомления(КонтрольВыписки = Истина, КонтрольОтчетовБрокера = Истина, Отказ = Ложь) Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;	
	КонецЕсли;
	
	МассивКаталогов = КаталогиДляПроверки();
	МассивОповещений = Новый Массив;
	Если КонтрольВыписки Тогда
		ПроверитьВыпискиБанка(МассивКаталогов, МассивОповещений, Отказ);
	КонецЕсли;
	
	Если КонтрольОтчетовБрокера Тогда
		ПроверитьОтчетыБрокера(МассивКаталогов, МассивОповещений, Отказ);
	КонецЕсли;
	
	Если МассивОповещений.Количество() > 0 Тогда
		СформироватьОповещение(МассивОповещений);	
	КонецЕсли;
	
КонецПроцедуры

Функция КаталогиДляПроверки()
	
	МассивКаталогов = Новый Массив;	
	МассивКаталогов.Добавить("\\g1\shares\NPF\MDTrust\Infinitum\MDT-FOTON\INFINITUM\SENT"); 
	МассивКаталогов.Добавить("\\g1\shares\NPF\MDTrust\Infinitum\MDT-FOTON\INFINITUM\-GAV-\SENT");
	
	Возврат МассивКаталогов;
	
КонецФункции	
	
Процедура ПроверитьВыпискиБанка(МассивКаталогов, МассивОповещений, Отказ)
			
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.НомерСчета КАК НомерСчета
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|ГДЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
		|	И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия > &Дата
		|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))");
	
	Запрос.УстановитьПараметр("Дата",							ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);  		
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	    		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СтрокаДаты = Формат(ЭтотОбъект.Дата, "ДФ=ddMMyyyy");
	Пока Выборка.Следующий() Цикл
		
		// Ищем файл
		ЕстьФайл = Ложь;		
		Для Каждого Каталог Из МассивКаталогов Цикл
			
			МассивФайлов = НайтиФайлы(Каталог, Выборка.НомерСчета + "_" + СтрокаДаты + ".txt");
			
			Если МассивФайлов.Количество() <> 0 Тогда
				ЕстьФайл = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;	
		
		Если Не ЕстьФайл Тогда
			ДобавитьОповещение(МассивОповещений, Выборка.НомерСчета);
			Продолжить;
		КонецЕсли;
		         
		//Проверяем содержимое
		Текст = Новый ТекстовыйДокумент;
		Текст.Прочитать(МассивФайлов[0].ПолноеИмя);
		
		КоличествоСтрок = Текст.КоличествоСтрок();
		
		КорректнаяДата = Ложь;
		КорректныйСчет = Ложь;
		
		Для Сч = 1 По КоличествоСтрок Цикл
			
			Если КорректнаяДата И КорректныйСчет Тогда
				Прервать;
			КонецЕсли;
			
			ТекСтрока = Текст.ПолучитьСтроку(Сч);
			Если СокрЛП(ТекСтрока) = "ДатаКонца=" + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") Тогда
				КорректнаяДата = Истина;
				Продолжить;
			КонецЕсли;
			
			Если СокрЛП(ТекСтрока) = "РасчСчет=" + Выборка.НомерСчета Тогда
				КорректныйСчет = Истина;
				Продолжить;
			КонецЕсли;
			
			Если СокрЛП(ТекСтрока) = "КонецРасчСчет" Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;	
		
		Если Не (КорректнаяДата И КорректныйСчет) Тогда
			ДобавитьОповещение(МассивОповещений, Выборка.НомерСчета, , Истина);	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьОтчетыБрокера(МассивКаталогов, МассивОповещений, Отказ)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код, """") КАК НомерСчета
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамБрокерские КАК ИсполнителиПоДенежнымСредствамБрокерские
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ПО ИсполнителиПоДенежнымСредствамБрокерские.Брокер = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер
		|ГДЕ
		|	ИсполнителиПоДенежнымСредствамБрокерские.Организация = &Организация
		|	И ИсполнителиПоДенежнымСредствамБрокерские.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И (ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия > &Дата
		|			ИЛИ ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))");
	
	Запрос.УстановитьПараметр("Дата",							ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);  		
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	    		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СтрокаДаты = Формат(ЭтотОбъект.Дата, "ДФ=ddMMyyyy");
	Пока Выборка.Следующий() Цикл
		
		// Ищем файл
		ЕстьФайл = Ложь;		
		Для Каждого Каталог Из МассивКаталогов Цикл
			
			МассивФайлов = НайтиФайлы(Каталог, "*отчет брокера ЗПИФ ФДЦБ " + СтрокаДаты + ".*");
			
			Если МассивФайлов.Количество() <> 0 Тогда
				ЕстьФайл = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;	
		
		Если Не ЕстьФайл Тогда
			ДобавитьОповещение(МассивОповещений, Выборка.НомерСчета, Истина);
			Продолжить;
		КонецЕсли;
		         
		//Проверяем содержимое
		ТаблицаФайла = Новый ТабличныйДокумент;
		ТаблицаФайла.Прочитать(МассивФайлов[0].ПолноеИмя, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		
		КоличествоСтрок = ТаблицаФайла.ВысотаТаблицы;
		
		КорректнаяДата = Ложь;
		КорректныйСчет = Ложь;
		
		НайдЯчейка = ТаблицаФайла.НайтиТекст("Уникальный код:");
		Если НайдЯчейка <> Неопределено И СтрНайти(НайдЯчейка.Текст, Выборка.НомерСчета) > 0 Тогда
			КорректныйСчет = Истина;		
		КонецЕсли;
		
		НайдЯчейка = ТаблицаФайла.НайтиТекст("(ОТЧЕТ БРОКЕРА)");
		Если НайдЯчейка <> Неопределено И СтрНайти(НайдЯчейка.Текст, Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy")) > 0 Тогда
			КорректнаяДата = Истина;		
		КонецЕсли;		
		
		Если Не (КорректнаяДата И КорректныйСчет) Тогда
			ДобавитьОповещение(МассивОповещений, Выборка.НомерСчета, Истина, Истина);	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОповещение(МассивОповещений, НомерСчета, ЭтоОтчетБрокера = Ложь, ПроверкаСодержимогоФайла = Ложь)
	
	МассивОповещений.Добавить(Новый Структура("НомерСчета, ЭтоОтчетБрокера, ПроверкаСодержимогоФайла", НомерСчета, ЭтоОтчетБрокера, ПроверкаСодержимогоФайла));
		
КонецПроцедуры

Процедура СформироватьОповещение(МассивОповещений)
	
	Текст = "Необходимо проверить отправку документов в СЭД ИНФИНИТУМ за " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + ":" + Символы.ПС;
	Для Каждого Оповещение Из МассивОповещений Цикл		
		Текст = Текст + "	- " + ?(Оповещение.ЭтоОтчетБрокера, "для отчета брокера", "для выписки банка") + " по счету " + Оповещение.Номерсчета + ?(Оповещение.ПроверкаСодержимогоФайла, " состав файла не соответствует наименованию", " не найден файл") + Символы.ПС; 		
	КонецЦикла;
		     				
	РеквизитыОповещения = Новый Структура();
	РеквизитыОповещения.Вставить("Текст",							Текст);
	РеквизитыОповещения.Вставить("Организация",						ЭтотОбъект.Организация);
	РеквизитыОповещения.Вставить("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);		
		
	Справочники.Оповещения.СформироватьОповещения(ЭтотОбъект.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
		
КонецПроцедуры

#Область Работа_с_регламентными_заданиями

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
		
	//Выполняем только в рабочие дни
	Если Не Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ТекущаяДата()) Тогда
		Возврат;
	КонецЕсли;
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	Если СтрНачинаетсяС(ИдентификаторКоманды, "КонтрольВыпискиВСЭДИнфинитум") Или  СтрНачинаетсяС(ИдентификаторКоманды, "КонтрольОтчетовБрокераВСЭДИнфинитум") Тогда
		
		ЭтотОбъект.Дата							= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата(), -2);
		ЭтотОбъект.Организация					= ПараметрыКоманды.Организация;
		ЭтотОбъект.СчетДоверительногоУправления = ПараметрыКоманды.СчетДоверительногоУправления;
				
#Область Сбор_статистики_начало

		Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВыполнитьКоманду()";
		
		ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(
			ЭтотОбъект, 
			"Дата,Организация,СчетДоверительногоУправления", 
			Новый Структура("ИдентификаторКоманды", ИдентификаторКоманды));
		
		Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);

#КонецОбласти

		ОтправитьУведомления(СтрНачинаетсяС(ИдентификаторКоманды, "КонтрольВыпискиВСЭДИнфинитум"), СтрНачинаетсяС(ИдентификаторКоманды, "КонтрольОтчетовБрокераВСЭДИнфинитум"));

#Область Сбор_статистики_конец

		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	

#КонецОбласти

	КонецЕсли;   	
	
КонецПроцедуры // ВыполнитьКоманду


#КонецОбласти
